{"timestamp": "2025-11-06T12:39:18.240598", "session_id": "38f88574-be19-4683-a81a-09fe45877bb0", "user_message": "ازاي اقدر اعمل كمبيالة وايه ميزتها اصلا", "search_str": "\"Information retrieving score: 0.65914243\\n\\n## نظرة عامة على متغيرات إدارة العملاء في أونكس أي إكس\\n\\nتحتوي أنظمة أونكس أي إكس ERP على مجموعة من المتغيرات الخاصة بنظام العملاء، والتي تُستخدم لضبط إعدادات النظام وتكييفه مع سياسات ومتطلبات المنشأة. تتيح شاشة المتغيرات للمستخدم التحكم في تفاصيل النظام، مثل ضبط البدائل الافتراضية، وتحديد سياسات العمل، وتفعيل أو تعطيل خصائص معينة. بعض المتغيرات لا يمكن تعديلها بعد استخدامها في العمليات المرتبطة، ويظهر حقل المتغير بلون باهت للدلالة على عدم إمكانية التعديل. يمكن للمستخدم استعراض المتغيرات والصلاحيات المؤثرة على كل شاشة من خلال قائمة عمليات الشاشة أو باستخدام الاختصار (Alt+M)، حيث تظهر شاشة تحتوي على المتغيرات والصلاحيات المؤثرة وإعداداتها على مستوى المستخدم.\\n\\n## طريقة استخدام شاشة متغيرات العملاء\\n\\nلاستخدام شاشة متغيرات العملاء، يجب أولاً النقر على زر \\\"تعديل\\\"، ثم يمكن للمستخدم ضبط القيم الخاصة بكل متغير حسب الحاجة. بعض المتغيرات تتطلب اختيار قيمة من قائمة (F9)، أو إدخال القيمة مباشرة، أو ترك الحقل فارغاً للدلالة على عدم تفعيل المتغير. يجب تحري الدقة عند ضبط المتغيرات، خاصة تلك التي لا يمكن تعديلها لاحقاً.\\n\\n## متغيرات تثبيت القيم وإدارة أرقام المستندات\\n\\n- **تثبيت القالب:** عند تفعيل هذا المتغير، يحتفظ النظام ببيانات آخر مستند تم حفظه في الشاشة (دون الخروج منها) ويعرضها كقيم افتراضية عند إضافة مستند جديد، مع إمكانية التعديل.\\n- **استخدام أرقام المستندات المحذوفة:** يسمح بإعادة استخدام الأرقام التسلسلية للمستندات المحذوفة. إذا لم يُفعّل، تُحتجز الأرقام المحذوفة ولا يعاد استخدامها، تعزيزاً للرقابة.\\n\\n## إدارة الكميات غير المتوفرة والأصناف المطلوبة\\n\\nعند تفعيل متغير \\\"إضافة الكميات الغير متوفرة إلى الأصناف المطلوبة عند الإدخال بالعمليات\\\"، إذا طلب العميل كمية أكبر من المتوفر، يقوم النظام بإدخال الكمية غير المتوفرة في شاشة \\\"الأصناف المطلوبة للعملاء\\\". مثلاً، إذا كانت الكمية المتوفرة 60 والمطلوبة 100، ينبه النظام المستخدم ويضيف الفارق (40) إلى الأصناف المطلوبة.\\n\\n## إظهار صافي السعر في العمليات\\n\\nبتفعيل متغير \\\"إظهار صافي السعر في العمليات\\\"، تظهر حقول صافي السعر وصافي المبلغ في عمليات المبيعات. صافي السعر يُحسب كالتالي: (السعر – الخصومات + الأعباء + الضريبة) للوحدة الواحدة، وصافي المبلغ = صافي السعر × الكمية.\\n\\n## ضبط إدخال الأرقام في تعريف العملاء والمندوبين والمسوقين والمحصلين\\n\\n- **استخدام الأرقام فقط في رقم العميل/المندوب/المحصل/المسوق:** عند تفعيل هذه المتغيرات، يُسمح بإدخال أرقام فقط في الحقول المخصصة لتعريف كل من العميل، المندوب، المحصل، والمسوق، ويمنع إدخال رموز أو حروف.\\n\\n## إدارة الأرقام التسلسلية وكروت الضمان في فاتورة المبيعات\\n\\n- **استخدام الرقم التسلسلي اليدوي للصنف في فاتورة المبيعات:** عند تفعيل المتغير، يظهر حقل رقم التسلسل اليدوي للصنف في فاتورة المبيعات ويكون إدخاله إجبارياً إذا كان الصنف يستخدم الضمان، ويجب أن تكون الكمية للصنف تساوي واحد.\\n- **إضافة كرت الضمان للصنف آلياً في فاتورة المبيعات:** عند تفعيل المتغير، يتم توليد كرت ضمان آلياً للأصناف التي تستخدم كرت ضمان عند استخدام الرقم التسلسلي اليدوي.\\n\\n## التحكم في إظهار الأدلة الفرعية والمخازن في العمليات\\n\\n- **إظهار اسم الدليل الفرعي 6/5/4/3/2/1 في العمليات:** يتحكم هذا المتغير في إظهار أو إخفاء أسماء الأدلة الفرعية في البيانات التفصيلية. يتم تعريف أسماء الأدلة الفرعية في شاشة \\\"تعريف مسميات الأدلة الفرعية\\\" ضمن التهيئة العامة.\\n- **استخدام تعدد المخازن في العمليات:** يسمح بالتعامل مع المخازن على مستوى الصنف في البيانات التفصيلية. إذا لم يُفعّل، يظهر اسم المخزن كحقل وحيد في البيانات الرئيسية.\\n- **إظهار اسم المخزن في العمليات:** يتحكم في إظهار أو إخفاء عمود \\\"اسم المخزن\\\" في البيانات التفصيلية لكل صنف.\\n\\n## إدارة الحقول الإضافية في العمليات\\n\\n- **إظهار حقل باركود الصنف في العمليات:** يتحكم في إظهار أو إخفاء عمود الباركود الخاص بالصنف في البيانات التفصيلية.\\n- **إظهار إجمالي الكميات في العمليات:** عند تفعيل المتغير، يظهر حقل إجمالي كميات الأصناف في شاشات العمليات.\\n- **عرض حزمة/الشد الصنف في العمليات:** يتحكم في إظهار أو إخفاء عمود \\\"الشد\\\" في البيانات التفصيلية.\\n\\n## فحص الكميات المرتجعة وربط العملاء بالمندوبين والمسوقين والمحصلين\\n\\n- **فحص الكمية المرتجعة لطلب العميل في فاتورة المبيعات:** يسمح بإعادة استخدام الكمية المرتجعة من طلب العميل عند إصدار الفواتير.\\n- **ربط العملاء بالمندوبين/المسوقين/المحصلين إجباري في العمليات:** يجبر النظام المستخدم على تحديد المندوب أو المسوق أو المحصل عند تحديد العميل في شاشات العمليات.\\n\\n## إدارة الحقول المرجعية والعمولات في العمليات\\n\\n- **إغلاق رقم المرجع بعد إدخاله بالفواتير:** يمنع تغيير رقم المرجع في شاشة \\\"فواتير المبيعات\\\" بعد الانتقال من الحقل.\\n- **إظهار عمولة المندوب حسب الصنف/إظهار عمولة المندوبين في فاتورة المبيعات:** يظهر النظام العمولات المستحقة للمندوبين لكل صنف أو لجميع المندوبين في شاشة \\\"فاتورة المبيعات\\\".\\n\\n## إدارة الخصومات على مستوى الصنف والفاتورة\\n\\n- **استخدام الخصم على مستوى الصنف:** يظهر حقول الخصم لإدخال الخصم على مستوى الصنف، ويعتمد عدد الحقول على متغير \\\"عدد الخصومات\\\"، وطريقة العرض (مبلغ/نسبة) على متغير \\\"نوع الخصم للأصناف\\\".\\n- **السماح بتعديل العرض الترويجي بعد اعتماده:** يسمح بالتعديل في شاشة \\\"العروض الترويجية\\\" حتى وإن كان العرض معتمد.\\n- **احتساب الخصم على مستوى الفاتورة من إجمالي السعر ناقص خصم الأصناف:** عند تفعيل المتغير، يُحتسب مبلغ خصم الفاتورة من إجمالي صافي مبلغ الأصناف بعد خصم الأصناف.\\n- **إظهار نسبة الخصم من الصنف آلياً في المبيعات:** يظهر النظام نسبة الخصم الخاصة بالصنف بشكل آلي عند إدخاله في شاشات عمليات المبيعات.\\n- **إعادة احتساب نسبة الخصم على مستوى الوثيقة عند تغيير سعر أو كمية الصنف:** يعيد النظام احتساب الخصم عند تغيير سعر أو كمية الصنف في البيانات التفصيلية.\\n\\n## إدارة الكميات المجانية في المبيعات\\n\\n- **استخدام الكميات المجانية في المبيعات:** يسمح بالتعامل مع الكميات المجانية في النظام.\\n- **إظهار نسبة الصنف من المجاني آلياً في المبيعات:** ينزل النظام الكميات المجانية آلياً إذا كانت معرفة في شاشة \\\"العروض الترويجية\\\" وتصنيفها \\\"سياسة\\\"، وإلا يتم إدخالها يدوياً.\\n- **ترحيل تكلفة المجاني إلى حساب الكميات المجانية:** عند تفعيل المتغير، تُرحل تكلفة الكميات المجانية إلى حساب منفصل عن تكلفة الكميات الأساسية، وإلا تُرحل إلى حساب تكلفة المبيعات الأساسي.\\n- **احتساب الضريبة على الكمية المجانية:** عند تفعيل المتغير، يحتسب النظام الضريبة على الكمية المجانية.\\n\\n## فحص حد الدين وفترة الائتمان للعملاء\\n\\n- **فحص حد الدين للعملاء وفترة الائتمان في طلبات العملاء/عروض الأسعار:** عند تفعيل المتغير، يفحص النظام أن العميل لم يتجاوز حد الدين أو فترة الائتمان في شاشات \\\"طلبات العملاء\\\" و\\\"عروض الأسعار\\\"، وينبه المستخدم عند التجاوز. يتم إدخال حد الدين وفترة الائتمان في شاشة \\\"بيانات العملاء\\\".\\n\\n## اعتماد كمية أمر الشراء والسماح بطلب أصناف غير مخزنة\\n\\n- **اعتماد كمية أمر الشراء في طلبات العملاء:** عند تفعيل المتغير، يتعامل النظام مع الكمية المعتمدة في أمر الشراء ككمية متوفرة عند استخدام شاشة طلبات العملاء.\\n- **السماح بعمل طلب عميل للأصناف غير المخزنة:** يسمح بإصدار طلب عميل حتى لو لم يتم تخزين الصنف في المخزن المحدد.\\n\\n## إدارة الأسعار والضريبة في العمليات\\n\\n- **استخدام السعر شامل الضريبة:** عند تفعيل المتغير، يظهر حقل \\\"طريقة عرض السعر\\\" في شاشات المدخلات والعمليات، ويحدد ما إذا كان السعر المدخل شامل الضريبة أو لا. يؤثر ذلك على طريقة احتساب الضريبة والخصومات في العمليات.\\n\\n## إدارة التعديلات في فواتير المبيعات\\n\\n- **السماح بتعديل رقم المخزن/طريقة الدفع/كمية طلب العميل في فاتورة المبيعات:** عند تفعيل هذه المتغيرات، يسمح النظام بتعديل رقم المخزن، طريقة الدفع، أو الكمية عند الإنزال من طلب العميل في شاشة \\\"فواتير المبيعات\\\".\\n\\n## إدارة إنزال الكميات والأسعار في العمليات\\n\\n- **عدم إنزال الكميات غير المتوفرة من طلبات العملاء إلى فاتورة المبيعات:** عند تفعيل المتغير، ينزل النظام فقط الكمية المتوفرة من الصنف في فاتورة المبيعات.\\n- **تجاوز كمية طلب العميل في إذن تسليم مبيعات:** يسمح بتجاوز الكمية المدخلة في طلب العميل عند الإنزال في شاشة \\\"إذن تسليم مبيعات\\\".\\n- **إنزال سعر الفاتورة السابقة عند إضافة فاتورة جديدة من فاتورة سابقة:** يسمح بإنزال أسعار الفاتورة الحالية في فاتورة جديدة باستخدام زر \\\"إضافة من\\\".\\n\\n## إدارة أنظمة الكوبونات والكمبيالات والأقساط\\n\\n- **استخدام نظام الكوبونات:** يسمح باستخدام نظام الكوبونات ويظهر الشاشات المتعلقة بها، كما يتيح طريقة دفع \\\"كوبون\\\" في شاشة \\\"فواتير المبيعات\\\".\\n- **استخدام الكمبيالات:** يسمح باستخدام الكمبيالات ويظهر الشاشات المتعلقة بها، كما يتيح تقسيم مديونية فاتورة المبيعات إلى أكثر من كمبيالة.\\n- **تسديد الأقساط يدوياً:** يسمح بتحديد القسط الذي سيتم تسديده من قبل العملاء في شاشة سندات القبض، ويظهر شاشة \\\"تسوية أقساط العملاء\\\".\\n\\n## إدارة الإيرادات والخصومات في العمليات\\n\\n- **ترحيل إيرادات المبيعات بالصافي بعد الخصم:** يظهر النظام صافي إيرادات المبيعات كإيراد بعد الخصم، ويؤثر ذلك على القيد المحاسبي الناتج عن العملية.\\n- **استخدام توسيط حساب الإيرادات المدفوعة مقدماً للفواتير مؤجلة الصرف:** عند تفعيل المتغير، يتم توسيط حساب الإيرادات المدفوعة مقدماً في الفاتورة، ثم يُقفل مع حساب الإيراد عند صرف الفاتورة.\\n- **احتساب الضريبة في الدفعات المقدمة:** عند تفعيل المتغير، يتم احتساب ضريبة على الدفعات المقدمة في سندات القبض، ثم عكس الضريبة في فاتورة المبيعات بناءً على عقد المبيعات.\\n\\n## إدارة عرض الأصناف وحدود التسعير في الفواتير\\n\\n- **عرض الأصناف ذات الكمية المتوفرة فقط في قائمة الأصناف في الفاتورة:** يعرض فقط الأصناف المتوفرة في المخازن عند البحث في شاشة الفاتورة.\\n- **فحص البيع بأقل من التكلفة للعرض الترويجي في فاتورة المبيعات:** يفحص النظام أن سعر العرض الترويجي ليس أقل من التكلفة.\\n- **فحص حدود التسعيرة للعرض الترويجي/من السعر ناقص الخصم في فاتورة المبيعات:** يفحص النظام أن سعر العرض الترويجي أو السعر بعد الخصم يقع ضمن الحدود المعرفة للصنف.\\n\\n## إدارة مستويات التسعيرة وربطها بالعملاء\\n\\n- **تثبيت مستوى التسعيرة للعميل في المبيعات:** يثبت مستوى تسعيرة واحد للعميل في المبيعات، ويتم ربطه في شاشة \\\"بيانات العملاء\\\".\\n- **إظهار مستوى التسعيرة في العمليات:** يظهر حقل \\\"المستوى\\\" في شاشات العمليات التي تحتوي على مستويات التسعيرة.\\n\\n## إدارة إدخال البيانات الإلزامية في العمليات\\n\\n- **إدخال رقم العميل إجباري في الفواتير النقدية:** يجبر المستخدم على إدخال رقم العميل في شاشة \\\"فواتير المبيعات\\\".\\n- **إدخال الأصناف في العقد إجباري:** يجبر المستخدم على إدخال بيانات الأصناف في شاشة \\\"عقود المبيعات\\\".\\n- **إدخال تاريخ الاستحقاق إجباري في الفواتير الآجلة:** يجعل إدخال تاريخ الاستحقاق للفواتير الآجلة إلزامياً.\\n\\n## إدارة مردود المبيعات والتدفيع والتسليم\\n\\n- **استخدام مردود مبيعات بدون تحديد رقم الفاتورة:** يسمح بإجراء مردود مبيعات دون تحديد رقم فاتورة مبيعات.\\n- **مردود المبيعات إلى نفس مخزن البيع:** يجبر رد المبيعات إلى نفس المخزن الذي تم منه البيع.\\n- **استخدام التدفيع والتسليم للفواتير والمردود:** يظهر شاشتي \\\"تدفيع الفواتير\\\" و\\\"تسليم الفواتير\\\" للتأكد من سداد وتسليم الفاتورة.\\n\\n## إدارة الأسعار في إذن تسليم المبيعات\\n\\n- **إظهار السعر في إذن تسليم مبيعات:** يظهر سعر البيع في شاشة \\\"إذن تسليم مبيعات\\\"، ويؤثر على القيد المحاسبي الناتج عن العملية.\\n\\n## إدارة الكميات المجانية والعروض الترويجية\\n\\n- **إنزال الكميات المجانية للأصناف في حالة وجود كميات مجانية عرض ترويجي:** يسمح بإنزال الكمية المجانية المعرفة في شاشة \\\"العروض الترويجية\\\" وتصنيفها \\\"سياسة\\\" أو \\\"عرض\\\".\\n- **السماح بخصم الأصناف في حالة وجود خصم عرض ترويجي:** يسمح بإنزال خصم الأصناف التي لها خصم عرض ترويجي.\\n- **استخدام الكميات المجانية الإضافية في المبيعات:** يظهر حقل الكمية المجانية الإضافية في نظام المبيعات عند تفعيل متغير \\\"استخدام الكميات المجانية في المبيعات\\\".\\n- **السماح بإدخال خصم يدوي للأصناف في حالة وجود عرض ترويجي:** يسمح بإدخال خصم يدوي حتى إذا كان الصنف له عرض ترويجي.\\n- **السماح بإدخال كميات مجانية يدوية للأصناف في حالة وجود عرض ترويجي:** يسمح بإدخال كميات مجانية يدوية حتى إذا كان الصنف له عرض ترويجي.\\n\\n## إدارة برنامج نقاطي والعمولات الفورية\\n\\n- **استخدام برنامج نقاطي:** يسمح باستخدام برنامج نقاطي لحساب نقاط للعميل عند الشراء واستبدالها لاحقاً.\\n- **استخدام العمولات الفورية للمبيعات:** يسمح باستخدام العمولات الفورية، حيث يتم احتساب العمولة مباشرة عند إنشاء فاتورة المبيعات.\\n- **ترحيل العمولات الفورية في فاتورة المبيعات:** يحدد طريقة ترحيل العمولات الفورية (غير مستخدم، تحصيل – قبض، من فاتورة المبيعات).\\n\\n## ربط الصراف البنكي والفواتير\\n\\n- **ربط صراف البنك بفاتورة المبيعات:** يربط بين الصراف البنكي وفاتورة المبيعات لإظهار تفاصيل السحب.\\n- **زمن الانتظار بالثواني للصراف الآلي في فاتورة المبيعات:** يحدد زمن الانتظار حتى تعبئة البيانات من الصراف إلى النظام.\\n\\n## إدارة ربط المندوبين والعملاء والأنشطة\\n\\n- **ترحيل المندوب إلى جميع أطراف القيد:** عند تفعيل المتغير، يتم ترحيل المندوب لكل الحسابات في القيد المحاسبي.\\n- **فحص ربط نشاط الصنف بالعميل:** يربط العميل بالأنشطة الخاصة بالصنف، ولا يسمح بالتعامل إلا مع الأصناف ذات النشاط المرتبط بالعميل.\\n- **فحص ربط العملاء بالوحدة المالية:** يفرض قيوداً على ربط العملاء بالوحدة المالية في شاشات العمليات.\\n\\n## إدارة فترات التوصيل وحجز الكميات\\n\\n- **استخدام فترات التوصيل لفواتير المبيعات:** يظهر حقل \\\"رقم فترة التوصيل\\\" في شاشات العمليات، ويتيح متابعة تسليم الفواتير للمندوبين.\\n- **حجز الكميات أثناء الحركات:** يحجز كمية الأصناف بمجرد إدخالها في شاشة فاتورة المبيعات، ويمنع استخدامها من قبل مستخدم آخر حتى إتمام العملية.\\n- **فترة حجز الكميات أثناء الحركات بالدقائق:** يحدد الفترة الزمنية لحجز الكميات أثناء التسجيل.\\n\\n## إدارة جدولة التسليم وحدود الدين في إذن التسليم\\n\\n- **استخدام جدولة تسليم الأصناف للعملاء:** يظهر شاشة \\\"جدولة تسليم الأصناف للعملاء\\\" لجدولة وقت ومكان تسليم الكميات.\\n- **فحص حد الدين للعملاء مع الإنزال لإذن التسليم:** يفحص حد الدين عند إنزال طلب العميل أو عرض السعر إلى إذن تسليم المبيعات.\\n- **احتساب الضريبة في فحص حد الدين للعملاء لإذن التسليم:** يحتسب الضريبة عند فحص حد الدين في إذن التسليم.\\n\\n## إدارة العملاء المنتظرين\\n\\n- **استخدام العملاء المنتظرون:** يظهر شاشة العملاء المنتظرون لترتيبهم أثناء تسجيل فاتورة لعميل آخر.\\n\\n## إدارة الربط مع الجهات والشركات الوسيطة\\n\\n- **استخدام الربط مع الجهات والشركات الوسيطة:** يظهر شاشات بيانات الجهات والشركات الوسيطة الخاصة بالربط مع تابي وتمارا.\\n- **إظهار طريقة ترتيب التوصيل بالتطبيق:** يسمح للمندوب بإعادة ترتيب الوثائق حسب الترتيب الافتراضي أو الموقع الأقرب.\\n\\n## إدارة عقود الخدمات وإثبات الإيرادات\\n\\n- **إثبات الإيرادات في عقود خدمات:** عند تفعيل المتغير، يتم إثبات الإيرادات في شاشة \\\"عقود الخدمات\\\" وفق قيود محاسبية محددة، وتختلف القيود في حالة عدم تفعيل المتغير.\\n- **استخدام عقود الخدمات:** يظهر شاشة \\\"عقود الخدمات\\\" في نظام المبيعات، ويتيح التعامل مع الأصناف الخدمية فقط.\\n\\n## متغيرات أخرى: إدارة تواريخ وأرقام الوثائق والكسور العشرية\\n\\n- **طريقة عرض تاريخ الوثيقة:** يحدد ما إذا كان تاريخ الوثيقة آلي يمكن تعديله أو يدوي أو آلي لا يمكن تعديله.\\n- **طريقة عرض رقم الوثيقة:** يحدد طريقة التعامل مع أرقام الوثائق (رقم آلي يمكن تعديله، رقم آلي لا يمكن تعديله، إدخال يدوي).\\n- **الكسور العشرية:** يحدد عدد الأرقام العشرية بعد الفاصلة للمبالغ المالية، مع إمكانية التعديل بالزيادة فقط.\\n\\n## إدارة أطوال أرقام العملاء والمندوبين والمحصلين والمسوقين\\n\\n- **أدنى/أعلى طول لرقم العميل/المندوب/المحصل/المسوق:** يحدد أقل وأعلى عدد من الأرقام يمكن قبوله لتخزين رقم كل من العميل، المندوب، المحصل، والمسوق.\\n\\n## إدارة الأدلة الفرعية والحقول الإضافية في العمليات\\n\\n- **طريقة استخدام الدليل الفرعي (1:6):** يحدد ما إذا كان الدليل الفرعي غير مستخدم، أو يُستخدم كحقل وحيد في البيانات الرئيسية، أو كأعمدة متعددة في البيانات التفصيلية.\\n- **عرض حقل إضافي (2/1) من بيانات الأصناف في العمليات:** يحدد نوعية البيانات الإضافية التي تظهر في العمليات.\\n- **عدد الحقول الإضافية في العمليات تحليلي:** يحدد عدد الحقول الإضافية التي تظهر كأعمدة إضافية في العمليات.\\n\\n## إدارة تكرار الأصناف وترحيل العمولات الفورية\\n\\n- **السماح بتكرار الصنف في العمليات:** يسمح بتكرار إدخال الصنف أكثر من مرة في شاشات العمليات، وإلا يمنع الحفظ عند التكرار.\\n- **ترحيل العمولات الفورية في فاتورة المبيعات:** يحدد طريقة ترحيل العمولات الفورية (غير مستخدم، تحصيل – قبض، من فاتورة المبيعات)، ويؤثر على القيد المحاسبي الناتج.\\n\\n## إدارة العروض الترويجية والخصومات\\n\\n- **طريقة إنزال العروض الترويجية من الطلبات إلى فواتير المبيعات:** يحدد ما إذا كان العرض الترويجي يُنزل كما هو من الطلب، أو يُعاد احتسابه في الفاتورة، أو يُعاد احتسابه للطلبات غير المسددة.\\n- **نوع الخصم للأصناف:** يحدد طريقة إدخال الخصومات (نسبة، مبلغ، نسبة ومبلغ).\\n- **عدد الخصومات:** يحدد عدد حقول الخصومات المتاحة على مستوى الصنف (حتى 4 خصومات).\\n- **إضافة الكسور إلى الخصم آلياً في المبيعات:** يحدد طريقة تعامل النظام مع الكسور (تسجيلها، إضافتها كخصم أو عبء، أو إضافتها كخصم آلياً).\\n- **طريقة ترحيل الخصم الإضافي:** يحدد ما إذا كان الخصم الإضافي يُرحل إلى حساب الخصم المسموح به أو إلى حساب محدد في شاشة \\\"إشعارات العملاء\\\".\\n\\n## إدارة احتساب الخصومات وحدود السجلات في العمليات\\n\\n- **طريقة احتساب الخصم للأصناف:** يحدد طريقة احتساب قيمة الخصم (نسبة × السعر أو السعر – قيمة الخصم السابقة).\\n- **الحد الأقصى لعدد سجلات الأصناف في العمليات:** يحدد أقصى عدد من سجلات الأصناف في البيانات التفصيلية.\\n- **الوثائق التي لها حد أقصى من عدد سجلات الأصناف:** يحدد الوثائق التي يُطبق عليها الحد الأقصى لعدد السجلات.\\n\\n## إدارة حدود التواريخ والحجز في العمليات\\n\\n- **الحد الأعلى لتاريخ انتهاء عرض السعر/طلب العميل/الحجز للأصناف:** يحدد الحد الأعلى بالأيام لتواريخ انتهاء العروض أو الطلبات أو الحجز للأصناف.\\n- **الحد الأعلى لطلب الأصناف لتاريخ معين في طلبات العملاء:** يحدد عدد الأيام المسموح بها لطلب الأصناف، ويؤثر على حقل \\\"تاريخ انتهاء الطلب\\\".\\n\\n## إدارة عرض الضريبة في العمليات\\n\\n- **طريقة عرض الضريبة في العمليات:** يحدد ما إذا كان حقل الضريبة يظهر كنسبة، مبلغ، أو نسبة ومبلغ في شاشات العمليات.\\n\\n## سياسة إنزال الأسعار من طلبات العملاء إلى فاتورة المبيعات\\n\\n- **سياسة إنزال الأسعار:** يحدد ما إذا كان السعر يُنزل من الطلب، أو السعر الافتراضي، أو يُدخل يدوياً في الفاتورة.\\n\\n## إدارة الحدود القصوى للكمية والسعر في عمليات المبيعات\\n\\n- **الحد الأقصى للكمية/السعر في عمليات المبيعات:** يحدد الحد الأقصى للكمية أو السعر في عمليات المبيعات.\\n\\n## إدارة طريقة التأثير المخزني\\n\\n- **طريقة التأثير المخزني:** يحدد ما إذا كان التأثير المخزني يتم في إذن تسليم المبيعات، أو في الفاتورة فورياً، أو في إذن صرف الفاتورة، ويؤثر ذلك على توقيت تسجيل القيد المالي للمخزون.\\n\\n## إدارة سياسة استخدام الموظفين وأعباء المبيعات\\n\\n- **سياسة استخدام الموظفين في المبيعات:** يحدد ما إذا كان حقل الموظف غير مستخدم، أو يُستخدم كحقل وحيد، أو متعدد في البيانات التفصيلية.\\n- **سياسة استخدام أعباء المبيعات حسب الصنف:** يتيح خيارات متعددة لتصنيف العبء (رقم الصنف، رقم المخزن، الوحدة المالية، رقم العميل، ... إلخ)، ويؤثر على طريقة عرض البيانات في شاشة \\\"تهيئة أعباء المبيعات\\\".\\n\\n## إدارة فترات الارتجاع وبطاقات الخصم والعمولات الفورية\\n\\n- **فترة الارتجاع بالأيام:** يحدد عدد الأيام المسموح بها لارتجاع الأصناف أو الفاتورة بالكامل.\\n- **سياسة استخدام بطاقة الخصم:** يحدد ما إذا كان استخدام بطاقة الخصم غير مستخدم، اختياري، إجباري لكل العملاء، إجباري للعملاء النقدي، أو إجباري للعملاء الآجل.\\n- **آلية إدخال العمولات الفورية:** يحدد ما إذا كان إدخال العمولة يدوي أو آلي في شاشة \\\"فواتير المبيعات\\\".\\n- **سياسة العمولات الفورية للمندوبين/المسوقين/الموظفين/السائقين/العملاء:** تحدد سياسة احتساب العمولات للفئات المختلفة.\\n\\n## إدارة سياسات وحدود المبيعات وفترات الأصناف\\n\\n- **سياسة حدود مبيعات الأصناف:** تحدد سياسة حدود مبيعات الأصناف (كوتا) لكل العملاء أو مجموعة عملاء.\\n- **سياسة حدود مبيعات العملاء:** تحدد سياسة حدود مبيعات العملاء على مستوى عناصر متعددة (صنف، عميل، وحدة مالية، مخزن، ... إلخ).\\n- **الفترة بالأيام للأصناف الموردة حديثاً:** تحدد الفترة الزمنية لظهور الأصناف الموردة حديثاً في النظام.\\n\\n## إدارة تكرار رقم المرجع وتواريخ الانتهاء والمقاطع\\n\\n- **السماح بتكرار رقم المرجع:** يحدد ما إذا كان النظام يسمح بتكرار رقم المرجع في العمليات.\\n- **طريقة إدخال تاريخ الانتهاء في الطلبات:** يحدد ما إذا كان إدخال تاريخ الانتهاء اختياري أو إجباري للأصناف التي تستخدم تاريخ انتهاء.\\n- **طريقة إدخال المقاطع في الطلبات:** يحدد ما إذا كان إدخال المقاطع التحليلية اختياري أو إجباري للأصناف التي تستخدم مقاطع تحليلية.\\n\\n## إدارة التحقق من التوصيل وOTP\\n\\n- **طريقة التحقق من التوصيل:** يحدد ما إذا كان التحقق من التوصيل يتم من التطبيق أو من النظام.\\n- **بالدقائق OTP وقت إعادة إرسال الكود/صلاحية الكود:** يحدد المدة الزمنية لإعادة إرسال رمز التحقق ومدة صلاحيته.\\n\\n## إدارة سياسات ترتيب التوصيل\\n\\n- **سياسة الترتيب في شاشة التوصيل:** يحدد ما إذا كان الترتيب حسب الشاشة أو حسب الموقع الأقرب.\\n- **طريقة اختيار ترتيب التوصيل:** يحدد ما إذا كان الترتيب يتم من شاشة \\\"توصيل فواتير المبيعات\\\" أو من سياسة التوصيل بالتهيئة.\\n\"", "final_ai_response": "مرحبًا، كيف يمكنني مساعدتك في أونتكس اليوم؟\n\nلإنشاء كمبيالة (Bill of Lading) في أونتكس، اتبع الخطوات التالية:\n\n1. انتقل إلى الشاشة `SD020` (شاشة معاملات المبيعات).\n2. أدخل تفاصيل البضاعة مثل رقم المستند والكمية والوصف.\n3. احفظ المستند.\n\n**ميزة الكمبيالة:**\n\nتُستخدم الكمبيالة في المعاملات التجارية لنقل الملكية من البائع إلى المشتري بشكل قانوني. فهي:\n\n- توفر دليلًا على الاستلام والتسليم.\n- تحمي حقوق جميع الأطراف.\n- تسهل عملية الشحن والنقل.\n\nهل لديك أي أسئلة أخرى حول أونتكس أو المعاملات المالية؟ أنا هنا للمساعدة!"}
